Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_008/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 26.907ms, rate sampling interval: 76ms
  Thread calibration: mean lat.: 19.205ms, rate sampling interval: 58ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.36ms   15.40ms 304.38ms   92.06%
    Req/Sec   100.42    117.01   568.00     82.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.63ms
 75.000%   28.19ms
 90.000%   37.66ms
 99.000%   81.21ms
 99.900%  185.60ms
 99.990%  264.45ms
 99.999%  304.64ms
100.000%  304.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.887     0.000000            1         1.00
      15.215     0.100000         3409         1.11
      16.767     0.200000         6802         1.25
      18.175     0.300000        10209         1.43
      19.855     0.400000        13591         1.67
      21.631     0.500000        16999         2.00
      22.559     0.550000        18702         2.22
      23.631     0.600000        20380         2.50
      25.023     0.650000        22073         2.86
      26.479     0.700000        23767         3.33
      28.191     0.750000        25474         4.00
      29.135     0.775000        26313         4.44
      30.159     0.800000        27172         5.00
      31.279     0.825000        28020         5.71
      32.671     0.850000        28868         6.67
      34.463     0.875000        29709         8.00
      35.903     0.887500        30139         8.89
      37.663     0.900000        30560        10.00
      39.519     0.912500        30991        11.43
      41.535     0.925000        31409        13.33
      43.743     0.937500        31833        16.00
      45.343     0.943750        32044        17.78
      47.583     0.950000        32255        20.00
      49.535     0.956250        32471        22.86
      52.447     0.962500        32679        26.67
      56.095     0.968750        32893        32.00
      57.471     0.971875        32998        35.56
      59.871     0.975000        33104        40.00
      63.135     0.978125        33210        45.71
      67.391     0.981250        33317        53.33
      72.511     0.984375        33423        64.00
      75.135     0.985938        33477        71.11
      77.759     0.987500        33529        80.00
      79.231     0.989062        33581        91.43
      82.367     0.990625        33634       106.67
      89.791     0.992188        33687       128.00
      97.791     0.992969        33715       142.22
     100.159     0.993750        33740       160.00
     119.103     0.994531        33767       182.86
     120.831     0.995313        33793       213.33
     130.047     0.996094        33820       256.00
     133.887     0.996484        33833       284.44
     149.375     0.996875        33846       320.00
     150.527     0.997266        33862       365.71
     165.759     0.997656        33873       426.67
     179.711     0.998047        33887       512.00
     179.967     0.998242        33896       568.89
     180.095     0.998437        33901       640.00
     180.991     0.998633        33906       731.43
     185.599     0.998828        33918       853.33
     185.727     0.999023        33920      1024.00
     185.983     0.999121        33924      1137.78
     186.111     0.999219        33926      1280.00
     186.239     0.999316        33929      1462.86
     186.623     0.999414        33933      1706.67
     240.895     0.999512        33936      2048.00
     245.759     0.999561        33938      2275.56
     249.343     0.999609        33939      2560.00
     251.135     0.999658        33941      2925.71
     253.951     0.999707        33943      3413.33
     254.463     0.999756        33944      4096.00
     255.103     0.999780        33945      4551.11
     258.943     0.999805        33946      5120.00
     259.711     0.999829        33948      5851.43
     259.711     0.999854        33948      6826.67
     259.711     0.999878        33948      8192.00
     264.447     0.999890        33949      9102.22
     264.447     0.999902        33949     10240.00
     269.823     0.999915        33950     11702.86
     269.823     0.999927        33950     13653.33
     269.823     0.999939        33950     16384.00
     298.751     0.999945        33951     18204.44
     298.751     0.999951        33951     20480.00
     298.751     0.999957        33951     23405.71
     298.751     0.999963        33951     27306.67
     298.751     0.999969        33951     32768.00
     304.639     0.999973        33952     36408.89
     304.639     1.000000        33952          inf
#[Mean    =       25.355, StdDeviation   =       15.403]
#[Max     =      304.384, Total count    =        33952]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35906 requests in 3.00m, 29.21MB read
Requests/sec:    199.45
Transfer/sec:    166.14KB